## 5. Consider two files that contain information about Employees and Departments in the following parameters: Employee (Name, EId, Salary, DID), Department (DID, DName, DLocation). Write a Python program to find the average salary of each department.

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('Employees.csv')
df1.head()

          Name  EId  Salary  DID
0     John Doe    1   50000    1
1   Jane Smith    2   60000    1
2  Bob Johnson    3   70000    2
3  Alice Brown    4   55000    1
4   Mike Davis    5   65000    3

In [3]:
df2 = pd.read_csv('Departments.csv')
df2.head()

   DID      DName      DLocation
0    1      Sales       New York
1    2  Marketing        Chicago
2    3         IT  San Francisco

In [4]:
merge_data = pd.merge(df1, df2, on='DID')
merge_data.head()

          Name  EId  Salary  DID      DName      DLocation
0     John Doe    1   50000    1      Sales       New York
1   Jane Smith    2   60000    1      Sales       New York
2  Bob Johnson    3   70000    2  Marketing        Chicago
3  Alice Brown    4   55000    1      Sales       New York
4   Mike Davis    5   65000    3         IT  San Francisco

In [6]:
avg_salary = merge_data.groupby('DName')['Salary'].mean().reset_index()
avg_salary

       DName   Salary
0         IT  61500.0
1  Marketing  59000.0
2      Sales  61600.0

## 6. Consider two files having some lines of statements. Write a Python program to swap content present at middle line of first file with the content of last line of the second file. (Note: First file contains odd numbers of lines of statement)